# Задача «Длина слова».
a = "Shamsiev" # задаю произвольную строку
длина_слова = len(a) # Вычисляем длину строки с помощью функции len()
print ('Задача 1')
print("Длина слова Shamsiev равно", длина_слова) # Выводим решение

# Задача «Суммы и разности»
first = 15
second = 10 #записываю два целых числа
summa = first + second
diff = first - second #вычисляю/задаю их сумму и разность
print ('Задача 2')
print('Сумма чисел 15 и 10 равно ', summa)
print('Разность чисел 15 и 10 равно', diff) # Выводим решение

# Задача «Среднее арифметическое»
first =15
second = 10
third = 35 #задаём три числа
mean = (first + second + third)/3
print ('Задача 3')
print('Среднее арифметическое чисел 15, 10, 35 равно ', mean)

#Задача «Простые строчки»
first_string = "Вторник"
second_string = "Понедельник" # Создаем две переменные first_string и second_string
print ('Задача 3')
print(second_string + ", " + first_string) # Выводим решение

# Задача «Сложная формула»
a = 5
b = 4
c = 3
f = (a * b) + (a * c)
fvkube = (f**3)
fvkubedelit2 = fvkube/2
print('Задача 4')
print('Результат вычислений', fvkubedelit2)



